zhac-project/zhac-wired-core/sdkconfig.defaults
# SPDX-FileCopyrightText: 2025-2026 Evgenij Cjura and project contributors
# SPDX-License-Identifier: AGPL-3.0-or-later
#
# zhac-wired-core sdkconfig.defaults — derived from zhac-mono-core with:
#   - target esp32s3 -> esp32p4
#   - all CONFIG_ESP_WIFI_* dropped (no WiFi anywhere in this build)
#   - CONFIG_SPIRAM_MODE_OCT dropped (S3 octal PSRAM; P4 configures its own)
#   - CONFIG_ESP32S3_DEFAULT_CPU_FREQ_* dropped (P4 default clock is correct)
#   + Ethernet MAC/PHY
CONFIG_IDF_TARGET="esp32p4"

# Minimum accepted silicon revision. VERIFY AGAINST YOUR PART BEFORE FLASHING.
#
# This ESP-IDF v6.0 only offers ESP32P4_REV_MIN_300 / _301 -- i.e. its esp32p4
# support starts at rev v3.0 -- and defaults to _301 (v3.1). We pick the more
# permissive _300 so a v3.0 part is also accepted.
#
# Two traps here:
#   1. `CONFIG_ESP32P4_REV_MIN_0=y` (as used in zhac-main-core/sdkconfig, which
#      was generated by an older IDF) is NOT a valid symbol in this IDF. An
#      unknown symbol in sdkconfig.defaults is silently ignored -- no warning,
#      no error -- so it looks set while doing nothing.
#   2. A revision mismatch fails at FLASH time, not build time. A green build
#      proves nothing about whether the binary will load.
#
# The ZHAC WT0132P4-A1 bench rig is rev v1.3, which this IDF cannot target at
# all. The Guition board's revision is unconfirmed -- read it from the boot log
# ("chip: esp32p4, rev vX.Y") and set this to match.
CONFIG_ESP32P4_REV_MIN_300=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n

# PSRAM is mandatory. RODATA + BSS placement are near-free on P4 thanks to
# its separate flash/PSRAM buses and L2 cache (same rationale as main-core).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_COMPILER_STACK_CHECK_MODE_STRONG=y
CONFIG_FREERTOS_ISR_STACKSIZE=4192
CONFIG_MAIN_TASK_STACK_SIZE=4192

CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_LWIP_MAX_SOCKETS=16

# Ethernet: internal EMAC + external RMII PHY (ESP-IDF supports RMII only).
# REF_CLK is sourced by the PHY. Do NOT switch to EMAC_CLK_OUT: with PSRAM
# enabled both share the MPLL, and at 80 MHz PSRAM speed no integer divisor
# yields 50 MHz within tolerance -- EMAC init fails outright.
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ETH_PHY_INTERFACE_RMII=y
CONFIG_ETH_RMII_CLK_INPUT=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_MBEDTLS_COMPILER_OPTIMIZATION_PERF=y
CONFIG_LWIP_IRAM_OPTIMIZATION=y
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=11520
CONFIG_LWIP_TCP_WND_DEFAULT=11520
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# No radio in Phase 0. Deliberately absent: CONFIG_ZHAC_NCP_ZNP / _EZSP / _C6.
# Phase 1 selects the esp-zigbee backend (ot_rcp on the onboard C6).
